---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalSetting.GetCircuitNamingSchemeSettings(Autodesk.Revit.DB.Document)
source: html/33a63ebf-0879-2386-9a91-b52d78b60462.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.GetCircuitNamingSchemeSettings Method

Gets the circuit naming scheme settings of the project.

## Syntax (C#)
```csharp
public static CircuitNamingSchemeSettings GetCircuitNamingSchemeSettings(
	Document cda
)
```

## Parameters
- **cda** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The circuit naming scheme settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null